package com.sist.main;

/*
 *  기본
 *    클래스 : 설계 => 요구사항 분석
 *    객체 : 결과물
 *    캡슐화 : 은닉 => 노출
 *          private => 메소드
 *    상속 : 공유
 *    다형성 : 상황별로 사용
 *    추상클래스 : 미완성된 설계도 => 개발자로 책임을 넘겨줌
 *    인터페이스 : 표준화 작업
 *    내부클래스 : 공통 변수/메소드
 *    ----------------------------------------- => 유지보수 용이하게 만드는게 목적
 *    => OOP(객체지향프로그램)에 연연할 필요는 없다
 *    
 *    메소드 : 변수 활용
 *           클래스끼리 통신
 *           한가지 기능만 수행
 *           여러 명령어로 처리 : 반듯 ㅣ처리 결과 하나
 *           다형성 : 기능 축
 *           public 리턴형 메소드명(리턴명)
 *           {
 *               return;  값이 없는 경우 void
 *               
 *               
 *    변수
 *      => 기본형
 *      => 클래스형(참조형)
 *      => 배열형(참조형)
 *        
 *    MethodArea / heap
 *    
 *    오버라이딩
 *    => 상속받은 메소드를 변경해서 사용
 *    => 메소드의 형태가 동일
 *        : 접근지정어 : 확대 가능 (낮은 범위에서 높은 범위로)
 *          리턴형
 *          메소드
 *          매개변수 
 * 
 */

public class 다형성_1 {
	class Super
	{
		
	}
	
	

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
